/**
 * Created by yuegu on 12/3/18.
 */
public class DearrangementOfString {
//又问了生成一个字符串 又问了生成一个字符串 又问了生成一个字符串 又问了生成一个字符串 又问了生成一个字符串 又问了生成一个字符串 又问了生成一个字符串 又问了生成一个字符串 又问了生成一个字符串 又问了生成一个字符串 string的 derangement，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考，字符串可能有重复的 。和以前考derangement都不太一样。 都不太一样。 都不太一样。 都不太一样。 一开始没考虑到重复字符的问题。 一开始没考虑到重复字符的问题。 一开始没考虑到重复字符的问题。 一开始没考虑到重复字符的问题。 一开始没考虑到重复字符的问题。 一开始没考虑到重复字符的问题。
  //2.给一个 给一个 char arr，问有多少个 ，问有多少个 ，问有多少个 ，问有多少个 permutation，condition是同样 是同样 letter不能在同一个 不能在同一个 不能在同一个 不能在同一个 index上 例如，【 例如，【 a，b，a】就是 】就是 0. 因为不管把其中哪一个 因为不管把其中哪一个 因为不管把其中哪一个 因为不管把其中哪一个 因为不管把其中哪一个 a移到哪，另外一个 移到哪，另外一个 移到哪，另外一个 移到哪，另外一个 a一定是在 一定是在 一定是在 index0或 者 2上，这样就不行。 上，这样就不行。 上，这样就不行。 上
}
