/**
 * Created by yuegu on 12/3/18.
 */
public class MathAndBrain {
//还问了一个证明题 还问了一个证明题 还问了一个证明题 还问了一个证明题 定义两个差为 定义两个差为 定义两个差为 2的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 的素数为一个对，让证明这两字中间夹那可以被 6整除 举个例子： 举个例子： 11和 13就是一对素数，然后 就是一对素数，然后 就是一对素数，然后 就是一对素数，然后 就是一对素数，然后 12可以被 6 整除
}
