/**
 * Created by yuegu on 12/3/18.
 */
public class OverlapOfTwoInterval {
/**
 * 2. 引子题，求两个 引子题，求两个 引子题，求两个 interval的 overlap部分 正题：给一组 正题：给一组 正题：给一组 rectangle，rectangle的表示跟 的表示跟 lc里的不同，是给了 里的不同，是给了 里的不同，是给了 里的不同，是给了 bottom left的 x，y，还 有 width和 height，求所有 ，求所有 ，求所有 rectangle overlap的部分。 的
 */

/**
 * ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 ，题目简单但是我被带跑偏了：求一组 Interval的交集。例如输入是 的交集。例如输入是 的交集。例如输入是 的交集。例如输入是 的交集。例如输入是 的交集。例如输入是 的交集。例如输入是 的交集。例如输入是 的交集。例如输入是 [1,3], [2,4], [3,5]，输出结果就应该是 ，输出结果就应该是 ，输出结果就应该是 [3,3]。 本来扫一遍出结果的事，大哥非要轮两求 本来扫一遍出结果的事，大哥非要轮两求 本来扫一遍出结果的事，大哥非要轮两求 本来扫一遍出结果的事，大哥非要轮两求 本来扫一遍出结果的事，大哥非要轮两求 intersection，比如第一轮得到 ，比如第一轮得到 ，比如第一轮得到 ，比如第一轮得到 ，比如第一轮得到 ，比如第一轮得到 ，比如第一轮得到 ，比如第一轮得到
 [2,3], [3,3], [3,4]。我说行吧，那就用个 。我说行吧，那就用个 。我说行吧，那就用个 。我说行吧，那就用个 helper把每轮结果的 把每轮结果的 把每轮结果的 把每轮结果的 list of intervals求出来。 求出来。 最后滚动到 最后滚动到 最后滚动到 list size为 1就是 结果。但没这个必要啊，又不就是 结果。但没这个必要啊，又不就是 结果。但没这个必要啊，又不就是 结果。但没这个必要啊，又不就是 结果。但没这个必要啊，又不就是 结果。但没这个必要啊，又不就是 结果。但没这个必要啊，又不就是 结果。但没这个必要啊，又不LeetCode 56。 加上 CodePair可以运行代码的鬼畜属性，自己定义 可以运行代码的鬼畜属性，自己定义 可以运行代码的鬼畜属性，自己定义 可以运行代码的鬼畜属性，自己定义 可以运行代码的鬼畜属性，自己定义 可以运行代码的鬼畜属性，自己定义 可以运行代码的鬼畜属性，自己定义 可以运行代码的鬼畜属性，自己定义 Interval，自己写 ，自己写 ，自己写 main method，还要 ，还要 自己 import，加起来写了二十几分钟终于 ，加起来写了二十几分钟终于 ，加起来写了二十几分钟终于 ，加起来写了二十几分钟终于 ，加起来写了二十几分钟终于 ，加起来写了二十几分钟终于 ，加起来写了二十几分钟终于 ，加起来写了二十几分钟终于 AC了
 */
}
