/**
 * Created by yuegu on 12/3/18.
 */
public class treeTraversal {
//recursive和 iterative的对 BT做 post-order traversal。 这题 LC上有，之前也做过 不上有，之前也做过 不上有，之前也做过 不上有，之前也做过 不上有，之前也做过 不没记住，写起来那个费劲呀别提了 没记住，写起来那个费劲呀别提了 没记住，写起来那个费劲呀别提了 没记住，写起来那个费劲呀别提了 没记住，写起来那个费劲呀别提了 没记住，写起来那个费劲呀别提了 没记住，写起来那个费劲呀别提了 ... recursive 的 sort a stack 要求空间是 要求空间是 要求空间是 O（n）还是 ）还是 O（1）来着，这题纯懵逼在各种提示 ）来着，这题纯懵逼在各种提示 ）来着，这题纯懵逼在各种提示 ）来着，这题纯懵逼在各种提示 ）来着，这题纯懵逼在各种提示 ）来着，这题纯懵逼在各种提示 ）来着，这题纯懵逼在各种提示 ）来着，这题纯懵逼在各种提示 下终于大概把思路想出来了 下终于大概把思路想出来了 下终于大概把思路想出来了 下终于大概把思路想出来了 下终于大概把思路想出来了 下
}
